In [5]:
import pandas as pd
import numpy as np

In [7]:

my_data=[10,20,30]
arr=np.array(my_data)
d={'a':10,'b':20,'c':30}

[10, 20, 30]

In [18]:
labels=['a','b','c']
# my_data=[10,20,30]
pd.Series(data=my_data,index=labels)
#Series can hold variety of data
pd.Series(labels) #Labeled index and value is series
pd.Series(d)
ser1=pd.Series([1,2],["Japan","Burkina Faso"])
ser2=pd.Series([1,3],["Portugal","Spain"])
ser1+ser2 #Combines two series, will add values where the labels are similar otherwise insert a NaN
            #Usually converts stuff to float

Burkina Faso   NaN
Japan          NaN
Portugal       NaN
Spain          NaN
dtype: float64

In [21]:
#Data Frames - Main tool Pandas
from numpy.random import randn
np.random.seed(101) #generates a sequence of same random numbers

df=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [30]:
df['W'] #returns a series
type(df['W'])
df[['W','Z']]
df['T']=df['X']+df['Y']
df
df.drop('T',axis=1,inplace=True)
df
df.drop('E')

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [36]:
df.shape
df.loc['A'] #returns label based index
df.iloc[1]#returns the row using index values 
df.loc['A','X'] 
df.loc[['A','B'],['X','Y']]

#Reading data from a csv files

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077

In [38]:
#Data Frames part 2
df1=pd.DataFrame(randn(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df1

          W         X         Y         Z
A -0.993263  0.196800 -1.136645  0.000366
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810
E -0.925874  1.862864 -1.133817  0.610478

In [54]:
bool_df=df1>0
bool_df
df1[bool_df]
val=df1['W']>0#this is a data frame object in itself
df1[val]['Z']

#or we can use 

df1[df1['W']>0][['X','Y']]

df1[(df1['W']>0)&(df1['X']<0)] #here simple and operation doesn't work as it takes 
                                #true and false arguments into consideration
df1[(df1['W']>0)|(df1['X']<0)] #here simple or operation not work, Truth value of series in ambiguous

          W         X         Y         Z
B  1.025984 -0.156598 -0.031579  0.649826
C  2.154846 -0.610259 -0.755325 -0.346419
D  0.147027 -0.479448  0.558769  1.024810

In [57]:
df1.reset_index() #resets index to a column value

  index         W         X         Y         Z
0     A -0.993263  0.196800 -1.136645  0.000366
1     B  1.025984 -0.156598 -0.031579  0.649826
2     C  2.154846 -0.610259 -0.755325 -0.346419
3     D  0.147027 -0.479448  0.558769  1.024810
4     E -0.925874  1.862864 -1.133817  0.610478

In [62]:
newind='NY OR OH CA IN'.split()
df['States']=newind #basically inserts new column
df.set_index("States")

               W         X         Y         Z
States
NY      2.706850  0.628133  0.907969  0.503826
OR      0.651118 -0.319318 -0.848077  0.605965
OH     -2.018168  0.740122  0.528813 -0.589001
CA      0.188695 -0.758872 -0.933237  0.955057
IN      0.190794  1.978757  2.605967  0.683509

In [68]:
#Data Frames part 3
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index=pd.MultiIndex.from_tuples(hier_index) #gets a multilevel data frame set which allows multiple leveled data sets

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [67]:
df3=pd.DataFrame(randn(6,2),hier_index,['A','B'])
df3

             A         B
G1 1 -1.382920  1.482495
   2  0.961458 -2.141212
   3  0.992573  1.192241
G2 1 -1.046780  1.292765
   2 -1.467514 -0.494095
   3 -0.162535  0.485809

In [71]:
df3.loc['G2'].loc[1]['B']

1.2927645769293514

In [73]:
# df3.xs(1,level='Num')

In [76]:
#missing data through pandas
#drop or fill in missing values 

d={'a':[1,2,np.nan],'b':[3,np.nan,np.nan],'c':[4,5,np.nan]}
df=pd.DataFrame(d)
df

     a    b    c
0  1.0  3.0  4.0
1  2.0  NaN  5.0
2  NaN  NaN  NaN

In [87]:
df.dropna(axis=0)#argument of axis can be done with any func
df.dropna(thresh=2)#this gives a threshold value upto which na can be accepted in a row
# df.fillna(value='FILL VALUE')#fill the not available data
df['a'].fillna(value=df['a'].mean())

0    1.0
1    2.0
2    1.5
Name: a, dtype: float64

In [ ]:
#Groupby method of pandas
# df.groupby(Column Name) for multilevel datasets

In [90]:
#OPERATIONS WITH PANDAS DATA SETS
dict={'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']}
df=pd.DataFrame(dict)
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [101]:
df['col2'].unique()
df['col2'].value_counts()
df[(df['col1']>2)&(df['col2']<500)]

   col1  col2 col3
3     4   444  xyz

In [111]:
def my_func(x):
    return x*3
df['col1'].apply(my_func)
df['col2'].apply(lambda x:x*10)
df.drop('col2',axis=1)
df.columns
df.sort_values(by='col1')
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [118]:
#Pivot Table 
dict={'A':['foo','foo','foo','bar','bar','bar'],'B':['one','one','two','two','one','one'],'C':['x','y','x','y','x','y'],'D':[1,3,2,5,4,1]}
df1=pd.DataFrame(dict)
print(df1)
df1.pivot_table(values='D',index=['A','B'],columns='C')

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [6]:
#DATA INPUT AND OUTPUT
#CSV
#EXCEL
#HTML
#SQL
import sqlalchemy
import lxml
import html5lib
import pandas as pd
import numpy as np

In [7]:
# pd.read_csv('example.csv')
data= pd.read_html('https://www.skims.ac.in/')

In [14]:
data[3]

,0,1,2
0,General Medicine Room 105 : Mon - Sat Room 107...,"Cardiology Room 153 : Mon - Thu, Sat Room 154 ...",Endocrinology Room 159 : Mon - Friday Room 160...
1,"Gastroenterology Room 137 : Mon, Tue, Thu, Fri...",Nephrology Room 157 : Mon - Sat,Neurology Room 162 : Mon - Sat
2,General & Minimal Invasive Surgery Room 111 : ...,CVTS Room 176 : Mon - Thu,"Urology Room 156 : Mon, Wed, Fri"
3,Plastic Surgery Room 127 : Mon - Sat Room 128 ...,Neuro Surgery Room 163 : Mon - Sat,"Surgical Gastroenterology Room 173 : Mon, Thu,..."
4,Anesthesiology Room 167 : Mon - Sat,"Nuclear Medicine Room 214 : Mon, Wed",Physical Medicine & Rehabilitation Room 307 : ...
5,Immunology & Molecular Medicine Room 137 : Wed...,Community Medicine Dental Unit : Mon - Sat Oph...,Diet Counselling (Endocrinology & Nephrology) ...
6,"Pulmonary Medicine Room 168 : Mon, Wed, Sat",Infectious Disease Room 168 : Tue & Thu,"Rheumatology Room 156 : Tue, Thu, Sat"
7,"Geriatric Medicine Room 177 : Mon, Sat",Breast Clinic Room 173 : Tue,"Colostomy Care Room 113 : Tue, Thu"
8,Psychiatry Room 177 : Fri,PCOD Clinic Room 125 : Thu,Colorectal Clinic Room 153 : Fri
9,Pre Kidney Transplant Clinic Room 138 : Wed,Kidney Transplant Unit Room 137 : Sat,Post COVID Clinic Room 174 : Tue & Thu
10,Neonatology & Paediatrics Room P-1 : Mon - Sat...,"Paediatric Surgery Room P-9 : Mon, Wed, Fri, Sat",Paediatric Endocrinology Room 159 : Saturday R...
11,Paediatric Respiratory Clinic Room P-7 : Sat,Pediatric Oncology Room P - 5 : Tue,NaN

In [16]:
#reading sql isn't best through pandas
from sqlalchemy import create_engine

In [20]:
engine=create_engine('sqlite:///:memory:')
dict={'A':['foo','foo','foo','bar','bar','bar'],'B':['one','one','two','two','one','one'],'C':['x','y','x','y','x','y'],'D':[1,3,2,5,4,1]}
df1=pd.DataFrame(dict)

In [21]:
df1.to_sql('my_table',engine)

6